In [166]:
import pandas as pd

## Series (aka row)
A Series is a one-dimensional object similar to an array or a list. It will automatically assign a index to each item. By default, each item will receive an index label from 0 to N, where N is the length of the Series minus one.

In [2]:
# create a Series with an arbitrary list
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [1]:
2 in s

NameError: name 's' is not defined

In [167]:
len(s)

5

## DataFrame (aka table)
A DataFrame is a tablular data structure comprised of rows and columns. You can also think of a DataFrame as a group of Series objects that share an index (the column names).

In [22]:
s_1 = pd.Series([1,2,3,4])
s_2 = pd.Series([5,6,7,8])
df = pd.DataFrame([s_1,s_2])
df.head()

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [24]:
data = {"year": [2002, 2006, 2010, 2014, 2018],
        "win": [True, True, True, True, False],
        "goals": [34, 40, 90, 50, 30]}

In [26]:
world_cup = pd.DataFrame(data)

In [27]:
world_cup.head()

   goals    win  year
0     34   True  2002
1     40   True  2006
2     90   True  2010
3     50   True  2014
4     30  False  2018

In [168]:
%pwd

'/Users/Jan/Documents/Privat/Studium/Like/HiWi/kaggle_workshop'

In [169]:
%ls

01.rtf                            mariano-rivera.csv.html
Pandas_Tests.ipynb                peyton-passing-TDs-2012.csv.html
city-of-chicago-salaries.csv      soccer_teams.csv

In [184]:
teams = pd.read_csv('soccer_teams.csv', delimiter=', ')
teams.head()

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

,Country,#,Position,FIFA Display Name,Last Name,First Name,Shirt Name,Date of Birth,Club,Club Country,Height
0,Algeria,1,Goalkeeper,Lounes GAOUAOUI,GAOUAOUI,Lounes,GAOUAOUI,28 Sep 1977,Chlef,ALG,188
1,Algeria,2,Defender,Madjid BOUGHERRA,BOUGHERRA,Madjid,BOUGHERRA,07 Oct 1982,Rangers,SCO,190
2,Algeria,3,Defender,Nadir BELHADJ,BELHADJ,Nadir,BELHADJ,18 Jun 1982,Portsmouth,ENG,180
3,Algeria,4,Defender,Anther YAHIA,YAHIA,Anther,YAHIA,21 Mar 1982,Bochum,GER,185
4,Algeria,5,Defender,Rafik HALLICHE,HALLICHE,Rafik,HALLICHE,02 Sep 1986,Nacional Madeira,POR,187

In [185]:
teams.describe()

               #      Height
count  736.00000  736.000000
mean    12.00000  181.548913
std      6.63776    6.717653
min      1.00000  165.000000
25%      6.00000  177.000000
50%     12.00000  182.000000
75%     18.00000  186.000000
max     23.00000  202.000000

## Selecting rows and columns

### 1. Index operator []

The index operator can be used in two ways. Firstly to select columns dataframe['columnname'] and secondly to select rows using slicing dataframe[1:10]

In [188]:
teams["Country"].head()

0    Algeria
1    Algeria
2    Algeria
3    Algeria
4    Algeria
Name: Country, dtype: object

In [189]:
teams[2:7]

,Country,#,Position,FIFA Display Name,Last Name,First Name,Shirt Name,Date of Birth,Club,Club Country,Height
2,Algeria,3,Defender,Nadir BELHADJ,BELHADJ,Nadir,BELHADJ,18 Jun 1982,Portsmouth,ENG,180
3,Algeria,4,Defender,Anther YAHIA,YAHIA,Anther,YAHIA,21 Mar 1982,Bochum,GER,185
4,Algeria,5,Defender,Rafik HALLICHE,HALLICHE,Rafik,HALLICHE,02 Sep 1986,Nacional Madeira,POR,187
5,Algeria,6,Midfielder,Yazid MANSOURI,MANSOURI,Yazid,MANSOURI,25 Feb 1978,Lorient,FRA,175
6,Algeria,7,Midfielder,Ryad BOUDEBOUZ,BOUDEBOUZ,Ryad,BOUDEBOUZ,19 Feb 1990,Sochaux,FRA,178

In [190]:
teams.iloc[2:5, 3:] # dataframe.iloc[rows, columns] (iloc = index location)

,FIFA Display Name,Last Name,First Name,Shirt Name,Date of Birth,Club,Club Country,Height
2,Nadir BELHADJ,BELHADJ,Nadir,BELHADJ,18 Jun 1982,Portsmouth,ENG,180
3,Anther YAHIA,YAHIA,Anther,YAHIA,21 Mar 1982,Bochum,GER,185
4,Rafik HALLICHE,HALLICHE,Rafik,HALLICHE,02 Sep 1986,Nacional Madeira,POR,187

In [2]:
teams.loc[2:5, " Shirt Name":] # dataframe.loc[rows, columns] (loc = label location)

NameError: name 'teams' is not defined

### 2. where() and bit masking

In [192]:
teams['Height'] > 180 # Returns Series object with True and False according to the condition

0       True
1       True
2      False
3       True
4       True
5      False
6      False
7      False
8       True
9      False
10      True
11      True
12      True
13     False
14     False
15     False
16      True
17      True
18      True
19     False
20     False
21     False
22      True
23      True
24      True
25     False
26     False
27      True
28     False
29     False
       ...
706    False
707    False
708     True
709     True
710    False
711    False
712     True
713     True
714     True
715     True
716     True
717     True
718    False
719    False
720     True
721    False
722    False
723    False
724    False
725    False
726     True
727    False
728    False
729     True
730     True
731     True
732    False
733     True
734    False
735     True
Name: Height, Length: 736, dtype: bool

In [194]:
type(teams['Height'] > 180)

pandas.core.series.Series

In [195]:
# | bitwise or     & bitwise and AUFGABE
teams[(teams['Height'] > 180) & (teams['Country'] == 'Germany')].head()

,Country,#,Position,FIFA Display Name,Last Name,First Name,Shirt Name,Date of Birth,Club,Club Country,Height
230,Germany,1,Goalkeeper,Manuel NEUER,NEUER,Manuel,NEUER,27 Mar 1986,Schalke 04,GER,190
231,Germany,2,Midfielder,Marcell JANSEN,JANSEN,Marcell,JANSEN,04 Nov 1985,Hamburger SV,GER,190
232,Germany,3,Defender,Arne FRIEDRICH,FRIEDRICH,Arne,FRIEDRICH,29 May 1979,Hertha Berlin,GER,185
233,Germany,4,Defender,Dennis AOGO,AOGO,Dennis,AOGO,14 Jan 1987,Hamburger SV,GER,184
234,Germany,5,Defender,Serdar TASCI,TASCI,Serdar,TASCI,24 Apr 1987,VfB Stuttgart,GER,186

In [198]:
teams.where((teams['Height'] > 180) & (teams['Country'] == 'Algeria')).head()

,Country,#,Position,FIFA Display Name,Last Name,First Name,Shirt Name,Date of Birth,Club,Club Country,Height
0,Algeria,1.0,Goalkeeper,Lounes GAOUAOUI,GAOUAOUI,Lounes,GAOUAOUI,28 Sep 1977,Chlef,ALG,188.0
1,Algeria,2.0,Defender,Madjid BOUGHERRA,BOUGHERRA,Madjid,BOUGHERRA,07 Oct 1982,Rangers,SCO,190.0
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Algeria,4.0,Defender,Anther YAHIA,YAHIA,Anther,YAHIA,21 Mar 1982,Bochum,GER,185.0
4,Algeria,5.0,Defender,Rafik HALLICHE,HALLICHE,Rafik,HALLICHE,02 Sep 1986,Nacional Madeira,POR,187.0

In [197]:
team_subset = teams[(teams['Height'] > 180) & (teams['Country'] == 'Germany')]
team_nosubset = teams.where((teams['Height'] > 180) & (teams['Country'] == 'Germany'))
print(len(team_subset))
print(len(team_nosubset))

16
736

In [199]:
teams.where((teams['Height'] > 180) & (teams['Country'] == 'Algeria'),"Test").head()

,Country,#,Position,FIFA Display Name,Last Name,First Name,Shirt Name,Date of Birth,Club,Club Country,Height
0,Algeria,1,Goalkeeper,Lounes GAOUAOUI,GAOUAOUI,Lounes,GAOUAOUI,28 Sep 1977,Chlef,ALG,188
1,Algeria,2,Defender,Madjid BOUGHERRA,BOUGHERRA,Madjid,BOUGHERRA,07 Oct 1982,Rangers,SCO,190
2,Test,Test,Test,Test,Test,Test,Test,Test,Test,Test,Test
3,Algeria,4,Defender,Anther YAHIA,YAHIA,Anther,YAHIA,21 Mar 1982,Bochum,GER,185
4,Algeria,5,Defender,Rafik HALLICHE,HALLICHE,Rafik,HALLICHE,02 Sep 1986,Nacional Madeira,POR,187

In [200]:
mask = (teams['Height'] > 180) & (teams['Country'] == 'Algeria')
teams.iloc[:, 3:5].where(mask, "Auto").head()

  FIFA Display Name  Last Name
0   Lounes GAOUAOUI   GAOUAOUI
1  Madjid BOUGHERRA  BOUGHERRA
2              Auto       Auto
3      Anther YAHIA      YAHIA
4    Rafik HALLICHE   HALLICHE

## Join dataframes

In [201]:
left_frame = pd.DataFrame({'key': range(5), 
                           'left_value': ['a', 'b', 'c', 'd', 'e']})
right_frame = pd.DataFrame({'key': range(2, 7), 
                           'right_value': ['f', 'g', 'h', 'i', 'j']})

In [202]:
left_frame

   key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e

In [203]:
right_frame

   key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j

In [204]:
pd.merge(left_frame,right_frame, how='inner')

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h

In [205]:
pd.merge(left_frame,right_frame, how='left')

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h

how : {'left', 'right', 'outer', 'inner'}, default 'inner'

left: use only keys from left frame (SQL: left outer join)

right: use only keys from right frame (SQL: right outer join)

outer: use union of keys from both frames (SQL: full outer join)

inner: use intersection of keys from both frames (SQL: inner join)

## Combine dataframes

In [206]:
pd.concat([left_frame, right_frame])

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c         NaN
3    3          d         NaN
4    4          e         NaN
0    2        NaN           f
1    3        NaN           g
2    4        NaN           h
3    5        NaN           i
4    6        NaN           j

In [207]:
pd.concat([left_frame, right_frame], axis=0) # change axis = 1

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c         NaN
3    3          d         NaN
4    4          e         NaN
0    2        NaN           f
1    3        NaN           g
2    4        NaN           h
3    5        NaN           i
4    6        NaN           j

## Grouping dataframes

In [208]:
!head -n 3 city-of-chicago-salaries.csv

Name,Position Title,Department,Employee Annual Salary
"AARON,  ELVIA J",WATER RATE TAKER,WATER MGMNT,$85512.00
"AARON,  JEFFERY M",POLICE OFFICER,POLICE,$75372.00

In [209]:
headers = ['name', 'title', 'department', 'salary']
chicago = pd.read_csv('city-of-chicago-salaries.csv', 
                      header=0,
                      names=headers,
                      converters={'salary': lambda x: float(x.replace('$', ''))})

In [210]:
chicago.head()

                    name                     title        department   salary
0        AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT  85512.0
1      AARON,  JEFFERY M            POLICE OFFICER            POLICE  75372.0
2    AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES  80916.0
3    ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  99648.0
4  ABBATACOLA,  ROBERT J       ELECTRICAL MECHANIC          AVIATION  89440.0

In [211]:
by_dept = chicago.groupby('department')
by_dept.mean().sort_values(by="salary", ascending=False).head()

                      salary
department
DoIT            93209.939394
BUILDINGS       90720.081322
FIRE            89579.082621
MAYOR'S OFFICE  85251.949091
BUDGET & MGMT   84767.181818